[
  {"name" : "", "img": "data/nelsonMachines/[INSERT MACHINE].png", "instructions": "", "muscles": [""]},
  {"name": "ab crunch", "img":  "data/nelsonMachines/abCrunch.png", "instructions":  "Select a light resistance and sit down on the ab machine placing your feet under the pads provided and grabbing the top handles. Your arms should be bent at a 90 degree angle as you rest the triceps on the pads provided. This will be your starting position.\nAt the same time, begin to lift the legs up as you crunch your upper torso. Breathe out as you perform this movement. Tip: Be sure to use a slow and controlled motion. Concentrate on using your abs to move the weight while relaxing your legs and feet.\nAfter a second pause, slowly return to the starting position as you breathe in.\nRepeat the movement for the prescribed amount of repetitions.", "muscles":  ["abdominals"]},
  {"name" : "back row", "img": "data/nelsonMachines/backRow.png", "instructions":  "Sit on the bench with your knees bent and grasp the cable attachment. It often has a triangle handle, but it may be a bar. Position yourself with your knees slightly bent, so you have to reach to grab the handle with outstretched arms without curling the lower back over. Brace the abdominals, and you're ready to row.\nPull the handle and weight back toward the lower abdomen while trying not to use the momentum of the row too much by moving the torso backward with the arms.\nTarget the middle to upper back by keeping your back straight and squeezing your shoulder blades together as you row, keeping your chest out.\nReturn the handle forward under tension to full stretch, remembering to keep that back straight even though flexed at the hips. Repeat the exercise for the desired number of repetitions.", "muscles":  ["upper back", "lower back"]},
  {"name" : "bench press", "img": "data/nelsonMachines/benchPress.png", "instructions":  "Lie on the bench with your eyes under the bar\nGrab the bar with a medium grip-width (thumbs around the bar!)\nUnrack the bar by straightening your arms\nLower the bar to your mid-chest\nPress the bar back up until your arms are straight", "muscles":  ["chest", "lower back", "triceps", "delts"]},
  {"name" : "calf raise", "img": "data/nelsonMachines/calfRaise.png", "instructions":  "Adjust the shoulder pad corresponding to your height.\nStep underneath the pad and place the balls of your feet on the platform with your toes pointed straight ahead - your heels will naturally hang off.\nExtend the hips and knees in order to raise the shoulder pad.\nLower the heels by dorsiflexing the ankles until the calves are fully stretched.\nExtend the ankles and exhale as you flex the calves.\nRepeat for the assigned number of repetitions.", "muscles":  ["calves"]},
  {"name" : "chest press", "img": "data/nelsonMachines/chestPress.png", "instructions":  "Grasp the handles with a full grip, your thumb circled around the handle.\nMaintain a neutral wrist position with your wrists in line with your forearms.\nExhale and push outward until your arms are fully extended (don't lock the elbows).\nKeep your head steady against the back support during this movement and your neck still. You should feel resistance against the horizontal push.\nPause briefly at full extension.\nBend your elbows and return to the starting position, breathing in during this recovery.", "muscles":  ["chest"]},
  {"name" : "chin dip", "img": "data/nelsonMachines/chinDip.png", "instructions":  "Grasp the handles with a wider-than-shoulder-width pronated (overhand) grip.\nKneel onto the knee pad and allow your bodyweight to weigh down the knee pad so that you hang with your arms and shoulders stretched. Exhale as you pull your body up until your chin rises over the bar.\nHold for a count of two and squeeze your back muscles.\nInhale as you lower your body until your arms and shoulders are fully stretched.\nRepeat.", "muscles":  ["upper back", "lower back", "delts"]},
  {"name" : "dependent curl", "img": "data/nelsonMachines/dependentCurl.png", "instructions":  "Adjust the seat height so backs of arms rest fully on arm pad, aligning elbows with machinespivot. Check the weight stack to ensure appropriate resistance. Rotate handle forward andgrip firmly. Body is positioned with chest up and shoulder back, leaning forward slightly if necessary to increase stability", "muscles":  ["biceps"]},
  {"name" : "double cable stack", "img": "data/nelsonMachines/doubleCableStack.png", "instructions":  "Depends on use.", "muscles":  ["triceps", "biceps", "upper back", "lower back", "chest", "shoulders", "delts"]},
  {"name" : "eliptical", "img": "data/nelsonMachines/eliptical.png", "instructions":  "Step onto the machine facing the monitor. Be careful stepping onto the machine. The pedals may start to move as you do and it can be easy to lose your balance. Grab the handlebars as you step on to help you stay balanced. \nBegin pedaling to turn it on. Taking a few steps forward on the machine should power up the display. If not, look for a start button. \nStart pedaling at an even pace. Your arms should be swinging with the handles. When your left foot goes down, straightening your leg, the right handle should be pulled toward your body. Same for when your right leg goes down.Do not lock your knees. Keep the knees slightly bent when straightening the leg on each stroke. Notice that it is similar to riding a bike without ever sitting down, but with less of an up and down range of motion. Faster is not always better on the elliptical machine. Turning up the resistance will make it so that you have to push harder on the pedals which will give your muscles a better work out.", "muscles":  ["hamstrings", "glutes", "calves", "quads", "chest", "abdominals", "cardio"]},
  {"name" : "glute trainer", "img": "data/nelsonMachines/gluteTrainer.png", "instructions":  "Enter the machine and sit on the set up seat\n\nAdjust the floating hip pad to the midsection\n\nSlide down on the back pad\n\nLift the pad with your hips, allowing the safety to fall away\n\nPerform the exercise with a hip thrust motion\n\nWhen complete - grab the safety handle and bring it to its starting position\n\nRest the weight on the safety\n\nLift the floating hip pad and exit the machine", "muscles":  ["hamstrings", "glutes", "abdominals"]},
  {"name" : "hip abductor", "img": "data/nelsonMachines/hipAbductor.png", "instructions":  "Setup in an upright position with your back against the pad and your spine neutral.\nExhale and push the legs apart as you open the pads.\nOnce your hips are fully externally rotated, slowly return to the starting position.\nRepeat for the desired number of repetitions.", "muscles": ["abductors", "abdominals", "glutes", "hamstrings", "hip flexors"]},
  {"name" : "lat pullDown", "img": "data/nelsonMachines/latPulldown.png", "instructions":  "Grasp the bar with a wide grip with an overhand, knuckles-up grip. Other positions and grips are possible but start with this standard position.\nPull the bar down until it's approximately level with the chin. Exhale on the downward motion. While shifting slightly backward is OK, aim to keep your upper torso stationary. Keep your feet flat on the floor and engage your abs as you pull. The bottom of the motion should be where your elbows can't move downward anymore without moving backward. Be sure to stop at that point and do not go lower.\nSqueeze the shoulder blades together while maintaining square shoulders.\nFrom the bottom position, with the bar close to your chin, slowly return the bar to the starting position while controlling its gradual ascent. Don't let it crash into the weight plates.\nContinue until you complete eight to 12 repetitions in a set. Rest, then continue to complete your program of sets.", "muscles": ["shoulders", "upper back"]},
  {"name" : "leg curl", "img": "data/nelsonMachines/legCurl.png", "instructions":  "Select the desired weight, then adjust the pad so it rests comfortably above the back of the heels.\nTense up the hamstrings by taking the weight slightly off the stack. This is the starting position for the exercise.\nTake a deep breath, squeeze the hamstrings, and curl the weight up as far as possible while keeping the spine neutral.\nSlowly lower the weight back to the starting position and repeat for the desired number of repetitions.", "muscles": ["hamstrings", "calves", "glutes", "quads"]},
  {"name" : "leg extension", "img": "data/nelsonMachines/legExtension.png", "instructions":  "Set up the leg extension machine so the pad is at the top of your lower legs at the ankles. Your knees are at 90 degrees. Select a weight that will give you a moderate load for 10 to 12 repetitions.\n\nPlace your hands on the hand bars.\nLift the weight while exhaling until your legs are almost straight. Do not lock your knees. Keep your back against the backrest and do not arch your back.\nExhale and lower the weight back to starting position.", "muscles": ["quads"]},
  {"name" : "leg press", "img": "data/nelsonMachines/legPress.png", "instructions": "Sit down on the leg press machine and place your legs on the platform in front of you, with your feet approximately a foot to one and half feet apart.\n Lower the safety bars holding the platform in place. Press the platform all the way up until your legs are fully extended, without locking your knees.\nAs you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.\nPush with the heels of your feet and use your quadriceps to go back to the starting position. Exhale as you do so.\nRepeat for the number of reps in your set. Make sure that the safety pins are locked properly once you have finished.", "muscles": ["quads", "hamstrings", "glutes"]},
  {"name" : "low row", "img": "data/nelsonMachines/lowRow.png", "instructions": "Sit down on the seat and grab the handles with your hands.\nPull the handles in to your chest.\nExtend your arms back out to starting position.\nThis completes one repetition.", "muscles": ["biceps", "forearms", "shoulders", "middle back"]},
  {"name" : "rear delt pec fly", "img": "data/nelsonMachines/rearDeltPecFly.png", "instructions": "Sit down on the seat with your stomach/chest touching the back of the seat. \n Make sure your seat is set so that your feet are flat on the floor. Sitting upright with good posture, your hands should be about shoulder height. \n Pick a weight on the machine. Start low and work your way up. 50-150 lbs is common.\nIn the starting position, lean your torso against the seat but with an upright posture, grab the top part of the handles with a pronated grip (knuckles up).\nSpread the levers apart, as far as you can, engaging and squeezing your back muscles.\nBring the levers back to the starting position slowly.\nRepeat for 8-20 repetitions, depending on the load and training style.", "muscles": ["shoulders", "delts"]},
  {"name" : "rotary torso", "img": "data/nelsonMachines/rotaryTorso.png", "instructions": "Place your knees on the bottom pads and your chest against upper pads.\nRotate at the torso to your right and then back to starting position.\nAfter you have done the desired amount of repetitions adjust the machine and then rotate to the left.", "muscles": ["obliques", "abdominals"]},
  {"name" : "shoulder press", "img": "data/nelsonMachines/shoulderPress.png", "instructions": "Adjust the seat to the right height and then sit down. \n Grab the handles and then push them up straight in the air.\nBring your hands back down to about eye level - you don't need to go all the way back down.\nThis completes one repetition.", "muscles": ["chest", "shoulders", "middle back", "triceps"]},
  {"name" : "sprint treadmill - cut this maybe", "img": "data/nelsonMachines/sprintTreadmill.jpg", "instructions": "", "muscles": [""]},
  {"name" : "squat rack", "img": "data/nelsonMachines/squatRack.png", "instructions": "Place the barbell at shoulder height.\nTurn around so that the barbell is below your neck and behind your shoulders.\nWith your arms positioned wide on the barbell, push up with your legs and straighten up to lift the barbell onto your back.\nStep forward and place your feet shoulder width apart with your toes pointing slightly outward.\nWith your back straight and your head up, inhale and bend your knees until you are in a seated position and your knees are perpendicular to your toes.\n Exhaling, push off with your heels to straighten your legs and return to a standing position.", "muscles": ["quads", "glutes", "hamstrings", "calves", "lower back", "hip flexors"]},
  {"name" : "stairmaster", "img": "data/nelsonMachines/stairmaster.png", "instructions": "Begin mid-height up the stair climber before starting it. Place your feet flat, shoulder-width apart.\nTurn the Stairmaster on and select your workout variation to get started.\nStart at a slow speed to warm up your muscles and get used to the rhythm of the machine before adjusting the speed.\nWhen you’re done, wait for the machine to come to a complete stop before stepping off.", "muscles": ["quads", "glutes", "hamstrings", "calves", "cardio"]},
  {"name" : "treadmill", "img": "data/nelsonMachines/treadmill.png", "instructions": "Step onto the treadmill and select the speed and incline that you'd like to use. \nWarm up with a slower speed and then work your way up to a higher speed.\nAfter you've completed your goal time/distance, either stop the treadmill or gradually slow your speed down until you come to a stop.", "muscles": ["quads", "glutes", "hamstrings", "cardio"]},
  {"name" : "triceps press", "img": "data/nelsonMachines/tricepsPress.png", "instructions": "Adjust seat so handles are level with lower chest (or slightly above or below based on your preference).\nGrab onto handles with either overhand, or neutral grip – once again, whatever you prefer or feel most comfortable with.\nPress handles down, squeezing triceps hard, keeping elbows tight to body.\nPause at the bottom before slowly allowing the handles to rise back up to the starting position – pause at the top, and repeat for the desired number of reps.", "muscles": ["triceps", "chest", "shoulders"]},
  {"name" : "triceps pulldown", "img": "data/nelsonMachines/tricepsPulldown.png", "instructions": "Start by bracing your abdominals.\nTuck your elbows in at your sides and position your feet slightly apart.\nInhale. Push down until your elbows are fully extended but not yet in the straight, locked position. Keep your elbows close to your body and bend your knees slightly on the pushdown. Resist bending forward. Try to keep your back as straight as possible as you push down.\nAs you exhale, return to the starting point using a controlled movement. Try not to crash the weights.", "muscles": ["triceps"]},
  {"name" : "vertical bench press", "img": "data/nelsonMachines/verticalBenchPress.png", "instructions":"[FILL IN]", "muscles": ["FILL IN"]},
  {"name" : "vertical chest press", "img": "data/nelsonMachines/verticalChestPress.png", "instructions": "Grasp the handles with a full grip, your thumb circled around the handle.\nMaintain a neutral wrist position with your wrists in line with your forearms.\nExhale and push outward until your arms are fully extended (don't lock the elbows).\nKeep your head steady against the back support during this movement and your neck still. You should feel resistance against the horizontal push.\nPause briefly at full extension.\nBend your elbows and return to the starting position, breathing in during this recovery.", "muscles": ["pectorals", "chest", "delts", "shoulders", "triceps"]}
]
